Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#








Router con0 is now available






Press RETURN to get started.













Router>enable
Router#
Router#show ip?
ip  ipv6  
Router#show ip ?
  access-lists  List access lists
  arp           IP ARP table
  bgp           BGP information
  dhcp          Show items in the DHCP database
  eigrp         IP-EIGRP show commands
  inspect       CBAC (Context Based Access Control) information
  interface     IP interface status and configuration
  ips           IPS (Intrusion Prevention System) information
  nat           IP NAT information
  nbar          Network-Based Application Recognition
  ospf          OSPF information
  protocols     IP routing protocol process parameters and statistics
  rip           IP RIP show commands
  route         IP routing table
  ssh           Information on SSH
Router#show ip interface
FastEthernet0/0 is administratively down, line protocol is down (disabled)
  Internet protocol processing disabled

Router#show ip interface ?
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Access    Virtual Access interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  brief             Brief summary of IP status and configuration
  <cr>
Router#show ip interface brief ?
  <cr>
Router#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
 
FastEthernet0/0        unassigned      YES unset  administratively down down
 
FastEthernet0/1        unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface ?
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  range             interface range command
Router(config)#interface fastethernet ?
  <0-9>  FastEthernet interface number
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address ?
  A.B.C.D  IP address
  dhcp     IP Address negotiated via DHCP
Router(config-if)#ip address 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip address 192.168.1.1 255.255.255.0 ?
  <cr>
Router(config-if)#ip address 192.168.1.1 255.255.255.0 
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
show ip ?
  access-lists  List access lists
  arp           IP ARP table
  bgp           BGP information
  dhcp          Show items in the DHCP database
  eigrp         IP-EIGRP show commands
  inspect       CBAC (Context Based Access Control) information
  interface     IP interface status and configuration
  ips           IPS (Intrusion Prevention System) information
  nat           IP NAT information
  nbar          Network-Based Application Recognition
  ospf          OSPF information
  protocols     IP routing protocol process parameters and statistics
  rip           IP RIP show commands
  route         IP routing table
  ssh           Information on SSH
Router#show ip interface ?
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Access    Virtual Access interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  brief             Brief summary of IP status and configuration
  <cr>
Router#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
 
FastEthernet0/0        192.168.1.1     YES manual administratively down down
 
FastEthernet0/1        unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip address ?
% Unrecognized command
Router(config)#interface ?
  Dot11Radio        Dot11 interface
  Ethernet          IEEE 802.3
  FastEthernet      FastEthernet IEEE 802.3
  GigabitEthernet   GigabitEthernet IEEE 802.3z
  Loopback          Loopback interface
  Serial            Serial
  Tunnel            Tunnel interface
  Virtual-Template  Virtual Template interface
  Vlan              Catalyst Vlans
  range             interface range command
Router(config)#interface fastethernet ?
  <0-9>  FastEthernet interface number
Router(config)#interface fastethernet 0/0
Router(config-if)#ip address ?
  A.B.C.D  IP address
  dhcp     IP Address negotiated via DHCP
Router(config-if)#ip address 192.168.1.1 ?
  A.B.C.D  IP subnet mask
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut down

%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
show ip ?
  access-lists  List access lists
  arp           IP ARP table
  bgp           BGP information
  dhcp          Show items in the DHCP database
  eigrp         IP-EIGRP show commands
  inspect       CBAC (Context Based Access Control) information
  interface     IP interface status and configuration
  ips           IPS (Intrusion Prevention System) information
  nat           IP NAT information
  nbar          Network-Based Application Recognition
  ospf          OSPF information
  protocols     IP routing protocol process parameters and statistics
  rip           IP RIP show commands
  route         IP routing table
  ssh           Information on SSH
Router#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
 
FastEthernet0/0        192.168.1.1     YES manual up                    up
 
FastEthernet0/1        unassigned      YES unset  administratively down down
 
Vlan1                  unassigned      YES unset  administratively down down
Router#